# vstCustomProcNNA

## Description
```pascal
FUNCTION vstCustomProcNNA(
				inEvent          : LONGINT;
				VAR outEvtResult : LONGINT;
				inMode           : LONGINT;
				inDiameter       : REAL;
				inSpacing        : REAL) : BOOLEAN;
```

```python

def vs.vstCustomProcNNA(inEvent, inMode, inDiameter, inSpacing):
    return (BOOLEAN, outEvtResult)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inEvent|LONGINT||
|outEvtResult|LONGINT||
|inMode|LONGINT||
|inDiameter|REAL||
|inSpacing|REAL||

## Version
Availability: from Vectorworks 2011
## Category
* Tool Events